In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
data = pd.Series([1,2,3,4,5])

In [4]:
data

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
data.values

array([1, 2, 3, 4, 5], dtype=int64)

In [6]:
data.index

RangeIndex(start=0, stop=5, step=1)

In [7]:
data[0]

1

In [8]:
data[1:3]

1    2
2    3
dtype: int64

In [9]:
data = pd.Series([1,2,3,4,5], index = ['a','b','c','d','e'])

In [10]:
data['c']

3

In [11]:
data = pd.Series(dict(a = 1, b = 2, c = 3, d = 4, e = 5))

In [12]:
data

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [14]:
data['b':'d']

b    2
c    3
d    4
dtype: int64

In [16]:
series_1 = pd.Series(dict(a = 1, b = 2, c = 3, d = 4, e = 5))

In [17]:
series_2 = pd.Series(dict(a = 11, b = 12, c = 13, d = 14, e = 15))

In [19]:
df = pd.DataFrame({'colum_1':series_1,'colum_2':series_2})

In [20]:
df

   colum_1  colum_2
a        1       11
b        2       12
c        3       13
d        4       14
e        5       15

In [21]:
df.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [22]:
df.columns

Index(['colum_1', 'colum_2'], dtype='object')

In [24]:
df['colum_1']

a    1
b    2
c    3
d    4
e    5
Name: colum_1, dtype: int64

In [27]:
df['colum_1']['a']

1

In [28]:
df['colum_2']['c']

13

In [35]:
df2 = pd.DataFrame([[1,2,3],[11,12,13]], index = ['a','b'], columns = ['col_1', 'col_2', 'col_3'])

In [36]:
df2

   col_1  col_2  col_3
a      1      2      3
b     11     12     13

In [38]:
df.at['a', 'colum_1']

1

In [40]:
df.at['b', 'colum_2'] = 100

In [41]:
df

   colum_1  colum_2
a        1       11
b        2      100
c        3       13
d        4       14
e        5       15

In [42]:
df.iat[2,0]

3

In [43]:
df.iat[3,1] = 1000

In [44]:
df

   colum_1  colum_2
a        1       11
b        2      100
c        3       13
d        4     1000
e        5       15

In [45]:
df.loc['b':'d', 'colum_1']

b    2
c    3
d    4
Name: colum_1, dtype: int64

In [46]:
df.loc['d':'e', 'colum_1':'colum_2'] = [[0.1, 0.2],[0.3, 0.4]]

In [47]:
df

   colum_1  colum_2
a      1.0     11.0
b      2.0    100.0
c      3.0     13.0
d      0.1      0.2
e      0.3      0.4

In [53]:
df.iloc[[1,3],[0,1]]

   colum_1  colum_2
b      2.0    100.0
d      0.1      0.2

In [51]:
df.iloc[[2,4],[0,1]] = [[1001,1002],[1003,1004]]

In [52]:
df

   colum_1  colum_2
a      1.0     11.0
b      2.0    100.0
c   1001.0   1002.0
d      0.1      0.2
e   1003.0   1004.0

In [54]:
df.iloc[[0,1],[0,1]] = [[3.1,1.4],[2.2,6.8]]

In [55]:
df

   colum_1  colum_2
a      3.1      1.4
b      2.2      6.8
c   1001.0   1002.0
d      0.1      0.2
e   1003.0   1004.0

In [56]:
df.to_csv('df_data.csv')

In [59]:
pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.0.10-py2.py3-none-any.whl (242 kB)
Collecting et-xmlfile
  Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.0.10
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 20.1.1; however, version 22.1.1 is available.
You should consider upgrading via the 'c:\users\cre\appdata\local\programs\python\python38\python.exe -m pip install --upgrade pip' command.

In [60]:
df2.to_excel('df2_data.xlsx')

In [66]:
df3 = pd.read_csv('df_data.csv', index_col=0)

In [68]:
df4 = pd.read_excel('df2_data.xlsx', index_col=0)

In [63]:
df2

   col_1  col_2  col_3
a      1      2      3
b     11     12     13

In [67]:
df3

   colum_1  colum_2
a      3.1      1.4
b      2.2      6.8
c   1001.0   1002.0
d      0.1      0.2
e   1003.0   1004.0

In [69]:
df4

   col_1  col_2  col_3
a      1      2      3
b     11     12     13